#include <stdio.h>
//#include <wchar.h>
#include <stdlib.h>
/*
		ФОРМАТ:
		%[флаги][ширина][.точность][размер]тип


		Флаги[править | править код]
Знак	Название знака	Значение													В отсутствие этого знака						Примечание
-		минус			выводимое значение выравнивается по левому
						краю в пределах минимальной ширины поля						по правому	


+		плюс			всегда указывать знак (плюс или минус) для 
						выводимого десятичного числового значения					только для отрицательных чисел	


 		пробел			помещать перед результатом пробел, если первый
 						символ значения не знак										Вывод может начинаться с цифры.					Символ + имеет больший приоритет, чем пробел. Используется только для десятичных числовых значений.


#		октоторп		«альтернативная форма» вывода значения																		При выводе чисел в формате перед числом будет указываться особенность формата. (см. ниже)


0		ноль			дополнять поле до ширины, указанной в поле
						ширина управляющей последовательности, символом 0			дополнять пробелами								Используется для типов d, i, o, u, x, X, a, A, e, E, f, F, g, G. Для типов d, i, o, u, x, X, если точность указана, этот флаг игнорируется. Для остальных типов поведение не определено.


*/


int		main(void)
{
	char *str = "hello, bro!";
	char *str1 = "дратуйти!";
	char *str2 = "こんにちは";

	int		number = 2579;
	int		ret;

	printf("%d\n", MB_CUR_MAX);
	ret = printf("s: %25s\n", str);
	printf("ret is: %d\n", ret);
	printf("------------------------------------------------\n");

	ret = printf("s: %s\n", str1);
	printf("ret is: %d\n", ret);
	printf("------------------------------------------------\n");

	ret = printf("s: %s\n", str2);
	printf("ret is: %d\n", ret);
	printf("------------------------------------------------\n");

	/*
	real_printf.c:43:26: warning: format specifies type 'wchar_t *' (aka 'int *') but the argument has type
      'char *' [-Wformat]
        ret = printf("S: %S\n", str);
                         ~~     ^~~

	ret = printf("S: %S\n", str);
	printf("ret is: %d\n", ret);
	printf("------------------------------------------------\n");
	*/

	ret = printf("p: %p\n", &str);
	printf("ret is: %d\n", ret);
	printf("------------------------------------------------\n");

	ret = printf("d: %-25d\n", number);
	printf("ret is: %d\n", ret);
	printf("------------------------------------------------\n");

	ret = printf("D: %D\n", number);
	printf("ret is: %d\n", ret);
	printf("------------------------------------------------\n");

	ret = printf("i: %i\n", number);
	printf("ret is: %d\n", ret);
	printf("------------------------------------------------\n");

	ret = printf("o: %o\n", number);
	printf("ret is: %d\n", ret);
	printf("------------------------------------------------\n");

	ret = printf("O: %O\n", number);
	printf("ret is: %d\n", ret);
	printf("------------------------------------------------\n");

	ret = printf("u: %u\n", number);
	printf("ret is: %d\n", ret);
	printf("------------------------------------------------\n");

	ret = printf("U: %U\n", number);
	printf("ret is: %d\n", ret);
	printf("------------------------------------------------\n");

	ret = printf("x: %x\n", number);
	printf("ret is: %d\n", ret);
	printf("------------------------------------------------\n");

	ret = printf("X: %X\n", number);
	printf("ret is: %d\n", ret);
	printf("------------------------------------------------\n");

	ret = printf("c: %c\n", *str);
	printf("ret is: %d\n", ret);
	printf("------------------------------------------------\n");

	ret = printf("C: %C\n", *str);
	printf("ret is: %d\n", ret);
	printf("------------------------------------------------\n");


	return 0;
}